parameters = {
    "search-country": "", # Страна
    # "search-region": "", # Область
    # "search-city": "", # Город
    "1_1_5_alias_gender": "Женщина", # Пол
    # "has_photo": False, # Только с фото
    # "is_online": False,
    "orderby": "Дате регистрации",
    # "view_view": "",
    "last_login": "7 дней",
    # "1_1_90_can_moving": "",
    "1_1_30_alias_marital_status": "В браке не состоял(а)",
    "1_1_31_field_31": "нет",
    "1_1_6_alias_birthdate-max": "30", # Возраст до
    "1_1_34_alias_goal": "Создание семьи", # Цель регистрации
    "1_1_42_field_42": "Да", # Вы воспитывались в полной семье?
    "1_1_88_field_88": "глава мужчина", # Ваше представление о мужской и женской ролях в семье
    # "": ,
    # "": ,
    # "": ,
    # "": ,
    # "": ,
    # "": ,
    # "": ,
    # "": ,
    # "": ,
    # "": ,
    # "": ,
    # "": ,
    # "": ,
    # "": ,
    # "": ,
    # "": ,
    # "": ,
    # "": ,
    # "": ,
    # "": ,
    # "": ,
    # "": ,
    # "": ,
    # "": ,
    # "": ,
    # "": ,
    # "": ,
    # "": ,
    # "": ,
    # "": ,
    # "": ,
    # "": ,
    # "": ,
    # "": ,
    # "": ,
}